espressif/esp-idf/components/soc/esp32s3/include/soc/pcnt_reg.h
#define PCNT_U0_STATUS_REG          (DR_REG_PCNT_BASE + 0x50)
/* PCNT_CNT_THR_ZERO_LAT_U0 : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_ZERO_LAT_U0    (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U0_M  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U0_V  0x1
#define PCNT_CNT_THR_ZERO_LAT_U0_S  6
/* PCNT_CNT_THR_H_LIM_LAT_U0 : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_H_LIM_LAT_U0    (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U0_M  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U0_V  0x1
#define PCNT_CNT_THR_H_LIM_LAT_U0_S  5
/* PCNT_CNT_THR_L_LIM_LAT_U0 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_L_LIM_LAT_U0    (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U0_M  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U0_V  0x1
#define PCNT_CNT_THR_L_LIM_LAT_U0_S  4
/* PCNT_CNT_THR_THRES0_LAT_U0 : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_THRES0_LAT_U0    (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U0_M  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U0_V  0x1
#define PCNT_CNT_THR_THRES0_LAT_U0_S  3
/* PCNT_CNT_THR_THRES1_LAT_U0 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_THRES1_LAT_U0    (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U0_M  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U0_V  0x1
#define PCNT_CNT_THR_THRES1_LAT_U0_S  2
/* PCNT_CNT_THR_ZERO_MODE_U0 : RO ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_ZERO_MODE_U0    0x00000003
#define PCNT_CNT_THR_ZERO_MODE_U0_M  ((PCNT_CNT_THR_ZERO_MODE_U0_V)<<(PCNT_CNT_THR_ZERO_MODE_U0_S))
#define PCNT_CNT_THR_ZERO_MODE_U0_V  0x3
#define PCNT_CNT_THR_ZERO_MODE_U0_S  0

#define PCNT_U1_STATUS_REG          (DR_REG_PCNT_BASE + 0x54)
/* PCNT_CNT_THR_ZERO_LAT_U1 : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_ZERO_LAT_U1    (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U1_M  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U1_V  0x1
#define PCNT_CNT_THR_ZERO_LAT_U1_S  6
/* PCNT_CNT_THR_H_LIM_LAT_U1 : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_H_LIM_LAT_U1    (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U1_M  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U1_V  0x1
#define PCNT_CNT_THR_H_LIM_LAT_U1_S  5
/* PCNT_CNT_THR_L_LIM_LAT_U1 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_L_LIM_LAT_U1    (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U1_M  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U1_V  0x1
#define PCNT_CNT_THR_L_LIM_LAT_U1_S  4
/* PCNT_CNT_THR_THRES0_LAT_U1 : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_THRES0_LAT_U1    (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U1_M  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U1_V  0x1
#define PCNT_CNT_THR_THRES0_LAT_U1_S  3
/* PCNT_CNT_THR_THRES1_LAT_U1 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_THRES1_LAT_U1    (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U1_M  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U1_V  0x1
#define PCNT_CNT_THR_THRES1_LAT_U1_S  2
/* PCNT_CNT_THR_ZERO_MODE_U1 : RO ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_ZERO_MODE_U1    0x00000003
#define PCNT_CNT_THR_ZERO_MODE_U1_M  ((PCNT_CNT_THR_ZERO_MODE_U1_V)<<(PCNT_CNT_THR_ZERO_MODE_U1_S))
#define PCNT_CNT_THR_ZERO_MODE_U1_V  0x3
#define PCNT_CNT_THR_ZERO_MODE_U1_S  0

#define PCNT_U2_STATUS_REG          (DR_REG_PCNT_BASE + 0x58)
/* PCNT_CNT_THR_ZERO_LAT_U2 : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_ZERO_LAT_U2    (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U2_M  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U2_V  0x1
#define PCNT_CNT_THR_ZERO_LAT_U2_S  6
/* PCNT_CNT_THR_H_LIM_LAT_U2 : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_H_LIM_LAT_U2    (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U2_M  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U2_V  0x1
#define PCNT_CNT_THR_H_LIM_LAT_U2_S  5
/* PCNT_CNT_THR_L_LIM_LAT_U2 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_L_LIM_LAT_U2    (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U2_M  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U2_V  0x1
#define PCNT_CNT_THR_L_LIM_LAT_U2_S  4
/* PCNT_CNT_THR_THRES0_LAT_U2 : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_THRES0_LAT_U2    (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U2_M  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U2_V  0x1
#define PCNT_CNT_THR_THRES0_LAT_U2_S  3
/* PCNT_CNT_THR_THRES1_LAT_U2 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_THRES1_LAT_U2    (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U2_M  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U2_V  0x1
#define PCNT_CNT_THR_THRES1_LAT_U2_S  2
/* PCNT_CNT_THR_ZERO_MODE_U2 : RO ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_ZERO_MODE_U2    0x00000003
#define PCNT_CNT_THR_ZERO_MODE_U2_M  ((PCNT_CNT_THR_ZERO_MODE_U2_V)<<(PCNT_CNT_THR_ZERO_MODE_U2_S))
#define PCNT_CNT_THR_ZERO_MODE_U2_V  0x3
#define PCNT_CNT_THR_ZERO_MODE_U2_S  0

#define PCNT_U3_STATUS_REG          (DR_REG_PCNT_BASE + 0x5C)
/* PCNT_CNT_THR_ZERO_LAT_U3 : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_ZERO_LAT_U3    (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U3_M  (BIT(6))
#define PCNT_CNT_THR_ZERO_LAT_U3_V  0x1
#define PCNT_CNT_THR_ZERO_LAT_U3_S  6
/* PCNT_CNT_THR_H_LIM_LAT_U3 : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_H_LIM_LAT_U3    (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U3_M  (BIT(5))
#define PCNT_CNT_THR_H_LIM_LAT_U3_V  0x1
#define PCNT_CNT_THR_H_LIM_LAT_U3_S  5
/* PCNT_CNT_THR_L_LIM_LAT_U3 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_L_LIM_LAT_U3    (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U3_M  (BIT(4))
#define PCNT_CNT_THR_L_LIM_LAT_U3_V  0x1
#define PCNT_CNT_THR_L_LIM_LAT_U3_S  4
/* PCNT_CNT_THR_THRES0_LAT_U3 : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_THRES0_LAT_U3    (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U3_M  (BIT(3))
#define PCNT_CNT_THR_THRES0_LAT_U3_V  0x1
#define PCNT_CNT_THR_THRES0_LAT_U3_S  3
/* PCNT_CNT_THR_THRES1_LAT_U3 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_THRES1_LAT_U3    (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U3_M  (BIT(2))
#define PCNT_CNT_THR_THRES1_LAT_U3_V  0x1
#define PCNT_CNT_THR_THRES1_LAT_U3_S  2
/* PCNT_CNT_THR_ZERO_MODE_U3 : RO ;bitpos:[1:0] ;default: 2'b0 ; */
/*description: .*/
#define PCNT_CNT_THR_ZERO_MODE_U3    0x00000003
#define PCNT_CNT_THR_ZERO_MODE_U3_M  ((PCNT_CNT_THR_ZERO_MODE_U3_V)<<(PCNT_CNT_THR_ZERO_MODE_U3_S))
#define PCNT_CNT_THR_ZERO_MODE_U3_V  0x3
#define PCNT_CNT_THR_ZERO_MODE_U3_S  0

#define PCNT_CTRL_REG          (DR_REG_PCNT_BASE + 0x60)
/* PCNT_CLK_EN : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CLK_EN    (BIT(16))
#define PCNT_CLK_EN_M  (BIT(16))
#define PCNT_CLK_EN_V  0x1
#define PCNT_CLK_EN_S  16
/* PCNT_CNT_PAUSE_U3 : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_PAUSE_U3    (BIT(7))
#define PCNT_CNT_PAUSE_U3_M  (BIT(7))
#define PCNT_CNT_PAUSE_U3_V  0x1
#define PCNT_CNT_PAUSE_U3_S  7
/* PCNT_PULSE_CNT_RST_U3 : R/W ;bitpos:[6] ;default: 1'b1 ; */
/*description: .*/
#define PCNT_PULSE_CNT_RST_U3    (BIT(6))
#define PCNT_PULSE_CNT_RST_U3_M  (BIT(6))
#define PCNT_PULSE_CNT_RST_U3_V  0x1
#define PCNT_PULSE_CNT_RST_U3_S  6
/* PCNT_CNT_PAUSE_U2 : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_PAUSE_U2    (BIT(5))
#define PCNT_CNT_PAUSE_U2_M  (BIT(5))
#define PCNT_CNT_PAUSE_U2_V  0x1
#define PCNT_CNT_PAUSE_U2_S  5
/* PCNT_PULSE_CNT_RST_U2 : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: .*/
#define PCNT_PULSE_CNT_RST_U2    (BIT(4))
#define PCNT_PULSE_CNT_RST_U2_M  (BIT(4))
#define PCNT_PULSE_CNT_RST_U2_V  0x1
#define PCNT_PULSE_CNT_RST_U2_S  4
/* PCNT_CNT_PAUSE_U1 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_PAUSE_U1    (BIT(3))
#define PCNT_CNT_PAUSE_U1_M  (BIT(3))
#define PCNT_CNT_PAUSE_U1_V  0x1
#define PCNT_CNT_PAUSE_U1_S  3
/* PCNT_PULSE_CNT_RST_U1 : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: .*/
#define PCNT_PULSE_CNT_RST_U1    (BIT(2))
#define PCNT_PULSE_CNT_RST_U1_M  (BIT(2))
#define PCNT_PULSE_CNT_RST_U1_V  0x1
#define PCNT_PULSE_CNT_RST_U1_S  2
/* PCNT_CNT_PAUSE_U0 : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: .*/
#define PCNT_CNT_PAUSE_U0    (BIT(1))
#define PCNT_CNT_PAUSE_U0_M  (BIT(1))
#define PCNT_CNT_PAUSE_U0_V  0x1
#define PCNT_CNT_PAUSE_U0_S  1
/* PCNT_PULSE_CNT_RST_U0 : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: .*/
#define PCNT_PULSE_CNT_RST_U0    (BIT(0))
#define PCNT_PULSE_CNT_RST_U0_M  (BIT(0))
#define PCNT_PULSE_CNT_RST_U0_V  0x1
#define PCNT_PULSE_CNT_RST_U0_S  0

#define PCNT_DATE_REG          (DR_REG_PCNT_BASE + 0xFC)
/* PCNT_DATE : R/W ;bitpos:[31:0] ;default: 32'h18072600 ; */
/*description: .*/
#define PCNT_DATE    0xFFFFFFFF
#define PCNT_DATE_M  ((PCNT_DATE_V)<<(PCNT_DATE_S))
#define PCNT_DATE_V  0xFFFFFFFF
#define PCNT_DATE_S  0


#ifdef __cplusplus
}
#endif



#endif /*_SOC_PCNT_REG_H_ */
